"""
9. Мастям гральних карт присвоєно порядкові номери: 1 - піки, 2 - трефи, 3 - бубни, 4 - черви.
Вартості карт, які старші за десятку, привласнені номери: 11 - валет, 12 - дама, 13 - король, 14 - туз.
Дано два цілих числа: N - вартість (6 ≤ N ≤ 14) і M - масть карти (1 ≤ M ≤ 4). Вивести назву
відповідної карти виду «шістка бубон», «дама черв», «туз треф», тощо.
Іванова Дар'я 141 група
"""


def get(n: int, m: int):
    s = "Ваша карта "
    if n == 6:
        s += "шестерка "
    elif n == 7:
        s += "семерка "
    elif n == 8:
        s += "восьмерка "
    elif n == 9:
        s += "девятка "
    elif n == 10:
        s += "десятка "
    elif n == 11:
        s += "валет "
    elif n == 12:
        s += "дама "
    elif n == 13:
        s += "король "
    elif n == 14:
        s += "туз "

    if m == 1:
        s += "пика"
    elif m == 2:
        s += "трефа"
    elif m == 3:
        s += "бубна"
    elif m == 4:
        s += "черва"
    return s


def check(n: int, m: int):
    while True:
        if 5 < n < 15:
            break
        else:
            print("НЕТ такой стоимости карты")
            n = int(input("Введите n(Стоимость карты)="))
    while True:
        if 0 < m < 5:
            break
        else:
            print("НЕТ такой масти карты")
            m = int(input("Введите m(Масть карты)="))
    return n, m


def cards(n: int, m: int):
    a, b = check(n, m)
    res = get(a, b)
    return res


if __name__ == '__main__':
    x = int(input("Введите n(Стоимость карты от 6 до 14)="))
    y = int(input("Введите m(Масть карты от 1 до 4)="))
    result = cards(x, y)
    print(result)
