"""
18. Шаховий кінь ходить буквою "Г" - на дві клітини по вертикалі в будь-якому напрямку і на одну
клітку по горизонталі, або навпаки. Дано дві різні клітини шахової дошки, визначте, чи може кінь
потрапити з першої клітини на другу одним ходом
Іванова Дар'я 141 група
"""


def check(x1: int, y1: int, x2: int, y2: int):
    while True:
        s = ""
        if y2 == y1 + 2 and (x2 == x1 + 1 or x2 == x1 - 1):
            s += "Лошадь может попасть из первой клетки на вторую одним ходом."
            break
        elif y2 == y1 - 2 and (x2 == x1 + 1 or x2 == x1 - 1):
            s += "Лошадь может попасть из первой клетки на вторую одним ходом."
            break
        elif x2 == x1 - 2 and (y2 == y1 + 1 or y2 == y1 - 1):
            s += "Лошадь может попасть из первой клетки на вторую одним ходом."
            break
        elif x2 == x1 + 2 and (y2 == y1 + 1 or y2 == y1 - 1):
            s += "Лошадь может попасть из первой клетки на вторую одним ходом."
            break
        else:
            print("Лошадь НЕ может попасть из первой клетки на вторую одним ходом.")
            print("Введите дригие координати второй клетки")
            x2 = int(input("Введите x2="))
            y2 = int(input("Введите y2="))
    return s


def horse(x1: int, y1: int, x2: int, y2: int):
    res = check(x1, y1, x2, y2)
    return res


if __name__ == '__main__':
    x = int(input("Введите x1(для расположения коня)="))
    y = int(input("Введите y1(для расположения коня)="))
    z = int(input("Введите x2="))
    d = int(input("Введите y2="))
    result = horse(x, y, z, d)
    print(result)
