"""
8. Описати функцію Fact2 (N) дійсного типу, яка обчислює подвійний факторіал: N!!=1·3·5·...·N,якщоN-непарне;
N!!=2·4·6·...·N,якщоN-парне
(N> 0 - параметр цілого типу; дійсне значення повертається функцією для того, щоб уникнути цілочисельного переповнення
при великих значеннях N). За допомогою цієї функції знайти подвійні факторіали п'яти даних цілих чисел.
Іванова Дар'я
"""


def check(n: int):
    fact = 1
    for b in range(2, n + 1):
        fact = fact * b
    return fact


def Fact2(n: int):
    res = check(n)
    return res


if __name__ == '__main__':
    for i in range(5):
        a = int(input("Введте n="))
        result = Fact2(a)
        print(result)
